{
  "title": "Strawberry Jam",
  "ingredients": [
    {
      "item": "2 pounds fresh strawberries, hulled",
      "quantity": "2",
      "unit": "pounds",
      "name": "fresh strawberries, hulled"
    },
    {
      "item": "4 cups white sugar",
      "quantity": "4",
      "unit": "cups",
      "name": "white sugar"
    },
    {
      "item": "¼ cup lemon juice",
      "quantity": "¼",
      "unit": "cup",
      "name": "lemon juice"
    }
  ],
  "instructions": [
    "Gather all ingredients.",
    "Crush strawberries in a wide bowl in batches until you have 4 cups of mashed strawberries.",
    "Combine mashed strawberries, sugar, and lemon juice in a heavy-bottomed saucepan; stir over low heat until sugar is dissolved.",
    "Increase heat to high, and bring the mixture to a full rolling boil. Continue to boil, stirring often, until the mixture reaches 220 degrees F (105 degrees C).",
    "Check doneness after 10 to 15 minutes by dropping a small spoonful of jam onto a frozen plate. Let sit for 1 to 2 minutes; if jam appears to gel, it is ready. Continue cooking if jam appears thin and runny.",
    "Transfer jam into hot sterile jars, filling to within 1/4 inch of the top. Top with lids and screw rings on tightly.",
    "Place a rack in the bottom of a large stockpot and fill it halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder.",
    "Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes.",
    "Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Store in a cool, dark area.",
    "Serve and enjoy!"
  ],
  "servings": "40 servings",
  "time_info": {},
  "rating": 4.7,
  "review_count": 948,
  "source": "AllRecipes",
  "source_url": "https://www.allrecipes.com/recipe/38410/strawberry-jam/",
  "image_url": "https://www.allrecipes.com/thmb/AfOW4MxO3aU3Mn2KkPVg8Q4BxSw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-RM-38410-strawberry-jam-ddmfs-1x2-95b856cc434f474b85b49b6709901517.jpg",
  "description": "This strawberry jam recipe is easy to make without pectin. Packed with fruity flavor, this delicious homemade jam lets you enjoy summer all year long!"
}