{
    "title": "Strawberry Jam",
    "ingredients": [
        "5 cups hulled and mashed strawberries",
        "4 tbsps fresh lemon juice, strained",
        "One 49-gram package powdered fruit pectin",
        "7 cups sugar"
    ],
    "instructions": [
        "Place the mason jars in a large hot water bath canner (or pot). Cover with water and bring to a simmer. Simmer the center lids in separate saucepan full of water.",
        "Place the mashed strawberries and lemon juice in a separate pot. Stir in the pectin until dissolved. Bring the strawberries to a strong boil.",
        "Add the sugar (measure beforehand so you can add it all at once), and then return the mixture to a full (violent) boil that can't be stirred down. Boil hard for 1 minute 15 seconds. Skim foam off the top.",
        "Remove one jar at a time from the simmering water. Pour water back into the pot. Using a wide-mouth funnel, fill each jar with jam, being careful to keep the liquid/fruit ratio consistent. Fill the jars so that they have 1/4-inch of space at the top. Run a knife down the side of the jar to get rid of air bubbles. Wipe the rim of the jar with a wet cloth to remove any residue or stickiness.",
        "Remove the center lid from the simmering water and position it on top. Put screw bands on jars, but do not over tighten! Repeat with all the jars, and then place the jars on a canning rack and lower into the water. Place the lid on the canner, and then bring the water to a full boil. Boil hard for 10 to 12 minutes.",
        "Turn off the heat and allow the jars to remain in the hot water for an addition 5 minutes.",
        "Remove the jars from the water using a jar lifter, and allow them to sit undisturbed for 24 hours.",
        "After 24 hours, remove the screw bands and check the seal of the jars. The center lids should have no give whatsoever. If any seals are compromised, store those jars in the fridge. Otherwise, fill your pantry with your newly canned goodness.",
        "Cook's Notes:",
        "Jars should be made from glass and free of any chips or cracks. Preserving or canning jars are topped with a glass, plastic, or metal lid, which has a rubber seal. Two piece lids are best for canning, as they vacuum seal when processed.",
        "To sterilize jars, before filling with jams, pickles, or preserves, wash jars and lids with hot, soapy water. Rinse well and arrange jars and lids open sides up, without touching, on a tray. Boil the jars and lids in a large saucepan, covered with water, for 15 minutes.",
        "Use tongs when handling the hot sterilized jars, to move them from boiling water. Be sure the tongs are sterilized too, by dipping the ends in boiling water for a few minutes.",
        "As a rule, hot preserves go into hot jars and cold preserves go into cold jars. All items used in the process of making jams, jellies, and preserves must be clean. This includes any towels used, and especially your hands."
    ],
    "servings": 8,
    "time_info": {
        "prep_time": "PT30M",
        "cook_time": "PT25M"
    },
    "rating": 4.5,
    "review_count": 24,
    "image_url": "https://d2vsf1hynzxim7.cloudfront.net/production/media/20681/conversions/foodnetwork-image-77784677-0be5-4874-8f77-22c33a14fc87-default.jpg",
    "description": "This mouth-watering recipe is ready in just 55 minutes and the ingredients detailed below can serve up to 8 people.",
    "source_url": "https://foodnetwork.co.uk/recipes/strawberry-jam"
}